'use client';

import Header from '@/ui/blocks/Header';
import Footer from '@/ui/blocks/Footer';
import classes from './Oferta.module.scss';

export default function OfertaPage() {
    return (
        <>
            <Header />
            <main className={classes.oferta}>
                <div className="container">
                    <div className={classes.content}>
                        <h1 className={classes.title}>ПУБЛІЧНА ОФЕРТА</h1>
                        <br />
                        ТзОВ "Т-Стиль"
                        <br />
                        про надання інформаційно-консультаційних послуг освітнього характеру
                        <br />
                        Пропозиція адресована невизначеному колу фізичних осіб, фізичних осіб-підприємців та юридичних
                        осіб, які є відвідувачами інтернет-ресурсу та зацікавлені в отриманні
                        інформаційно-консультаційних послуг освітнього характеру на умовах, зазначених нижче.
                        <br />
                        <br />
                        1. ТЕРМІНИ ТА ВИЗНАЧЕННЯ
                        <br />
                        1.1. Акцепт – це повне, безумовне та беззастережне прийняття пропозиції укласти договір про
                        надання інформаційно-консультаційних послуг.
                        <br />
                        1.2. Веб-сайт – сукупність даних, електронної (цифрової) інформації, інших об’єктів авторського
                        права і (або) суміжних прав тощо, взаємопов’язаних і структурованих в межах адреси сайту:
                        <a href="https://fundament2025.com/">https://fundament2025.com/</a>.
                        <br />
                        1.3. Веб-сторінка Заходу – невід’ємна частина веб-сайту, що містить інформацію про порядок
                        надання інформаційних та консультаційних послуг в рамках Заходу (Програма Заходу, формат
                        проведення, дата та час).
                        <br />
                        1.4. Виконавець – ТзОВ "Т-Стиль", організатор Заходу, який надає інформаційно-консультаційні
                        послуги.
                        <br />
                        1.5. Замовник – фізична особа та/або ФОП та/або юридична особа, яка прийняла умови Оферти.
                        <br />
                        1.6. Захід – майстер-клас, семінар, конференція, онлайн-інтенсив, тренінг, навчальна програма або
                        інший діловий захід, в рамках якого надаються інформаційні та консультаційні послуги.
                        <br />
                        1.7. Оферта – пропозиція укласти договір, розміщена в мережі Інтернет за посиланням:
                        <a href="https://fundament2025.com/">https://fundament2025.com/</a>.
                        <br />
                        1.8. Програма Івентів – етапи (модулі, інформаційні блоки тощо) надання інформації на певну тему.
                        <br />
                        1.9. Сторони – Виконавець та Замовник.
                        <br />
                        1.10. Інші терміни, що використовуються в Оферті, визначені відповідно до чинного законодавства
                        України.
                        <br />
                        <br />
                        2. ПРЕДМЕТ ОФЕРТИ
                        <br />
                        2.1. Виконавець зобов’язується надавати інформаційні та консультаційні послуги (далі – «Послуги»)
                        в рамках участі Замовника у заході Всеукраїнський будівельний саміт “Фундамент Незламності”, а
                        Замовник зобов’язується прийняти та оплатити ці послуги.
                        <br />
                        2.2. Порядок надання послуг, Програма Заходу, формат проведення (наживо або онлайн), дата та час
                        визначаються на сторінці Заходу.
                        <br />
                        2.3. Виконавець може надавати додаткові, супутні та інші послуги, у тому числі продаж
                        інформаційних продуктів з платним доступом до контенту.
                        <br />
                        <br />
                        3. ПОРЯДОК УКЛАДЕННЯ ТА ВИКОНАННЯ ДОГОВОРУ
                        <br />
                        3.1. Перед укладенням Договору Замовник повинен ознайомитися з Офертою і, у разі незгоди з
                        умовами, не вчиняти дій, спрямованих на укладення Договору.
                        <br />
                        3.2. Попередня згода на Оферту:
                        <br />• 3.2.1. Реєстрація Замовника на Захід на сайті Заходу з вказанням прізвища, імені, по
                        батькові, телефону та електронної пошти.
                        <br />• 3.2.2. При замовленні платного контенту – натискання кнопки «Купити» із зазначенням
                        прізвища, імені, по батькові та електронної пошти.
                        <br />
                        3.3. Акцепт Оферти здійснюється шляхом оплати Замовником замовлених Послуг.
                        <br />
                        3.4. Виконавець та Замовник погоджуються, що з моменту Акцепту Договір вважається укладеним у
                        письмовій формі без підписання примірника.
                        <br />
                        <br />
                        4. ПРАВА ТА ОБОВ’ЯЗКИ СТОРІН
                        <br />
                        4.1. Виконавець зобов’язується:
                        <br />• Надавати Послуги відповідно до умов Оферти.
                        <br />• Інформувати про місце та умови проведення Заходу не пізніше ніж за 1 день до початку.
                        <br />• Забезпечити матеріально-технічні засоби та доступ до онлайн-ресурсів.
                        <br />• Надати доступ до інформаційного контенту відповідно до умов веб-сторінки.
                        <br />
                        4.2. Виконавець має право:
                        <br />• Змінювати порядок, місце, дату та час надання Послуг з повідомленням Замовника.
                        <br />• Залучати третіх осіб для виконання зобов’язань.
                        <br />• Публікувати інформацію про хід та результати надання Послуг.
                        <br />• Здійснювати аудіо-, фото- та відеофіксацію.
                        <br />• Припиняти виконання зобов’язань у разі невиконання Замовником своїх обов’язків.
                        <br />
                        4.3. Замовник зобов’язується:
                        <br />• Оплачувати Послуги.
                        <br />• Інформувати про зміну контактних даних.
                        <br />• Відшкодовувати шкоду майну Виконавця.
                        <br />• Не передавати третім особам навчальні матеріали.
                        <br />• Дотримуватись правил проведення Заходу.
                        <br />
                        4.4. Замовник має право:
                        <br />• Отримувати Послуги відповідно до умов Оферти.
                        <br />• Отримувати інформацію про Послуги.
                        <br />
                        <br />
                        5. ВАРТІСТЬ ТА ПОРЯДОК ОПЛАТИ
                        <br />
                        5.1. Вартість залежить від обраного пакету участі:
                        <br />
                        Базові ціни:
                        <br />• Виставкова зона – 999 грн
                        <br />• Спікерська зона – 1999 грн
                        <br />• VIP зона – 3999 грн
                        <br />
                        Від 20.10 (+20%):
                        <br />• Виставкова зона – 1199 грн
                        <br />• Спікерська зона – 2399 грн
                        <br />• VIP зона – 4799 грн
                        <br />
                        Реквізити для оплати:
                        <br />
                        ТзОВ "Т-Стиль"
                        <br />
                        Україна, 79058, м. Львів, вул. Ставова, буд. 7
                        <br />
                        ЄДРПОУ: 41402389
                        <br />
                        Рахунок: UA203282090000026009000005634
                        <br />
                        Банк: ПАТ "АБ "ПІВДЕННИЙ"
                        <br />
                        МФО: 328209
                        <br />
                        5.2. Оплата здійснюється безготівково на рахунок Виконавця.
                        <br />
                        5.3. Послуги вважаються оплаченими з моменту надходження коштів.
                        <br />
                        5.4. Зміни вартості можливі при проведенні акцій.
                        <br />
                        5.5. Повернення коштів можливе тільки при скасуванні заходу Виконавцем.
                        <br />
                        <br />
                        6. ПОРЯДОК НАДАННЯ ТА ПРИЙМАННЯ ПОСЛУГ
                        <br />
                        6.1. Якщо Замовник не надав мотивовану відмову протягом 10 днів після закінчення Акції, Послуги
                        вважаються наданими.
                        <br />
                        6.2. Після заходу може бути надано акт про надання послуг.
                        <br />
                        6.3. Послуга платного доступу до контенту вважається наданою з моменту надання доступу на
                        електронну пошту Замовника.
                        <br />
                        <br />
                        7. ТЕРМІН ДІЇ ОФЕРТИ ТА ДОГОВОРУ
                        <br />
                        7.1. Оферта діє з моменту публікації на сайті Виконавця.
                        <br />
                        7.2. Виконавець має право змінювати умови або відкликати Оферту в будь-який час.
                        <br />
                        7.3. Акцепт Оферти створює Договір на умовах цієї Оферти.
                        <br />
                        7.4. Договір діє до повного виконання зобов’язань Сторонами або розірвання.
                        <br />
                        7.5. Договір може бути розірваний:
                        <br />• за взаємною згодою;
                        <br />• Виконавцем у разі невиконання Замовником зобов’язань;
                        <br />• Виконавцем у разі скасування заходу з поверненням коштів.
                        <br />
                        <br />
                        8. ВІДПОВІДАЛЬНІСТЬ
                        <br />
                        8.1. Сторони несуть відповідальність відповідно до чинного законодавства України.
                        <br />
                        8.2. Виконавець не відповідає за непрямі збитки.
                        <br />
                        8.3. Замовник не має права вимагати компенсації моральної або матеріальної шкоди.
                        <br />
                        8.4. Спори вирішуються шляхом переговорів або у суді за місцем знаходження Виконавця.
                        <br />
                        8.5. Форс-мажор звільняє сторони від відповідальності та продовжує терміни виконання
                        зобов’язань.
                        <br />
                        <br />
                        9. ІНШІ УМОВИ
                        <br />
                        9.1. Замовник гарантує достовірність даних при реєстрації та оплаті.
                        <br />
                        9.2. Акцепт Оферти означає:
                        <br />• згоду на фото- та відеозйомку;
                        <br />• згоду на використання образу, відео, коментарів у рекламних та інформаційних матеріалах;
                        <br />• згоду на обробку персональних даних відповідно до Політики конфіденційності.
                        <br />
                        9.3. Замовник відповідає за надання персональних даних третіх осіб.
                        <br />
                        9.4. Телефонні розмови можуть записуватися для контролю якості.
                        <br />
                        9.5. Замовник усвідомлює ризики доступу даних третім особам через збій або технічні проблеми.
                        <br />
                        9.6. Документи, повідомлення та запити, надіслані електронними або факсом, мають юридичну силу.
                        <br />
                        <br />
                        10. ДАНІ ПРЕДСТАВНИКА
                        <br />
                        Грендиш Галина
                        <br />
                        E-mail: <a href="mailto:galinazatv.gg@gmail.com">galinazatv.gg@gmail.com</a>
                        <br />
                        Телефон: <a href="tel:+380970705577">+380 (97) 070 55 77</a>
                    </div>
                </div>
            </main>
            <Footer />
        </>
    );
}